--- a/doc/analisis-report.md
+++ b/doc/analisis-report.md
@@ -220,93 +241,59 @@ sequenceDiagram
 - Scenario Alternatif
 Supprime manuellement les posts qui ont echappé l'analyse des sentiments 
 
-```plantuml
-@startuml
-
-actor Administarteur as Adm
-participant WallCaster as Wl 
-
-
-activate Adm
-activate Wl
-
-
-Adm -> Wl : choix listes des posts en db
-Wl -> Adm : affiche liste posts
-Adm -> Wl : choix type
-Wl -> Adm : Suppression effectuée
-
-@enduml
-```
-
 ```mermaid
 sequenceDiagram
-  actor A as Admin
-  participant W as WallCaster
 
-  A ->> W : choix listes des posts en db
-  W ->> A : affiche liste posts
-  A ->> W : Choix type
-  W ->> A : Suppression effectuée
+actor Adm as Administarteur
+participant Wl as WallCaster 
+
+Adm ->> Wl : choix listes des posts en db
+Wl ->> Adm : affiche liste posts
+Adm ->> Wl : choix type
+Wl ->> Adm : Suppression effectuée
 ```
 
 <br/>
 
